** Running this file


First we tangle the file, by running M-x org-babel-tangle
Then run in the shell "./exSession.hs"

Now we can test the server by evaluating various options :
#+BEGIN_SRC sh
curl http://localhost:8080/public
#+END_SRC

#+BEGIN_SRC sh
curl http://localhost:8080/private
#+END_SRC

#+BEGIN_SRC sh
curl -X GET 'http://localhost:8080/private' -H 'servant-auth-cookie: key1'
#+END_SRC

#+BEGIN_SRC sh
curl -X GET 'http://localhost:8080/private' -H 'servant-auth-cookie: badkey'
#+END_SRC

     + other options for tangling
       + directly in emacs with M-x org-babel-tangle
       + running the block with C-c C-c
          #+BEGIN_SRC elisp
            (org-babel-tangle)
          #+END_SRC

          #+RESULTS:
          | exSession.hs | make.sh |

       + by running the script below (in command line or with C-c C-c)
          #+BEGIN_SRC sh
            emacs --batch -l org Https.org -f org-babel-tangle
          #+END_SRC
       + by tangling every file org with this script (the block itself can be tangled to a bash script which uses nix)
          #+BEGIN_SRC elisp :tangle make.sh :shebang "#! /usr/bin/env nix-shell\n#! nix-shell -i \"emacs --script\"  -p \"pkgs.emacsWithPackages(epkgs: (with epkgs.melpaPackages; [ dash ]))\"\n#! nix-shell -I nixpkgs=channel:nixos-18.09"
    (package-initialize)
    (require 'dash)
    (require 'ob-tangle)
    (let ((orgfiles  (directory-files "." nil ".*org")))
      (-map (lambda (n) (org-babel-tangle-file n)) orgfiles)    
      )
  #+END_SRC



